# 배열의 인덱싱
# 배열명[위치]
import numpy as np

a1 = np.array([0, 10, 20, 30, 40, 50])
print(a1)
# [ 0 10 20 30 40 50]

print(a1[0])  # 0
print(a1[4])  # 49

a1[5] = 70
print(a1)   # [0 10 20 30 40 70]
print(a1[[1,3,4]])  # [10 30 40

# np 배열 타입
a2 = np.arange(10, 100, 10).reshape(3,3)
print(a2)
'''
[[10 20 30]
 [40 50 60]
 [70 80 90]]
'''
print(a2[0, 2])  # 30

# 리스트 타입
l1 = [[10,20,30],[40,50,60],[70,80,90]]
print(l1[0][2])  # 30

a2[2, 2] = 95
print(a2)
'''
[[10 20 30]
 [40 50 60]
 [70 80 95]]
'''

print(a2[1])  # [40 50 60]
a2[1] = np.array([45,55,65])
print(a2)
'''
[[10 20 30]
 [45 55 65]
 [70 80 95]]
'''

# 2차원 배열 a2에서 (0,0), (2,1) 위치의 원소를 선택한다.
print(a2[[0,2], [0,1]])  # [10 80]

a = np.array([1,2,3,4,5,6])
print(a[a>3])  # [4 5 6]
print(a[(a%2)==0])  # [2 4 6]
