# 엑셀 파일의 데이터 읽기
# df = pd.read_excel()
import pandas as pd
df = pd.read_excel('./ch16_excel/학생시험성적.xlsx')
print(df)
'''
  학생  국어  영어  수학         평균
0  A  80  90  85  85.000000
1  B  90  95  95  93.333333
2  C  95  70  75  80.000000
3  D  70  85  80  78.333333
4  E  75  90  85  83.333333
'''

df = pd.read_excel('./ch16_excel/학생시험성적.xlsx', sheet_name=1)
print(df)
'''
  학생  과학  사회   역사         평균
0  A  90  95   85  90.000000
1  B  85  90   80  85.000000
2  C  70  80   75  75.000000
3  D  75  90  100  88.333333
4  E  90  80   90  86.666667
'''

df = pd.read_excel('./ch16_excel/학생시험성적.xlsx', sheet_name='2차시험')
print(df)
'''
  학생  과학  사회   역사         평균
0  A  90  95   85  90.000000
1  B  85  90   80  85.000000
2  C  70  80   75  75.000000
3  D  75  90  100  88.333333
4  E  90  80   90  86.666667
'''

df = pd.read_excel('./ch16_excel/학생시험성적.xlsx', sheet_name='2차시험', index_col=0)
print(df)
'''
    과학  사회   역사         평균
학생
A   90  95   85  90.000000
B   85  90   80  85.000000
C   70  80   75  75.000000
D   75  90  100  88.333333
E   90  80   90  86.666667
'''

df = pd.read_excel('./ch16_excel/학생시험성적.xlsx', sheet_name='2차시험', index_col='학생')
print(df)
'''
    과학  사회   역사         평균
학생
A   90  95   85  90.000000
B   85  90   80  85.000000
C   70  80   75  75.000000
D   75  90  100  88.333333
E   90  80   90  86.666667
'''


